Wedge_Throttle_kEps/system/fvSchemes_utrcOriginal
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear ;
    grad(x)         leastSquares;
}

divSchemes
{
    default         Gauss limitedLinear 1;
    div(phi,U)      Gauss limitedLinearV 1; 
    div(volPhi,rho) Gauss limitedLinear 1;
    div(phid,p)     Gauss limitedLinear 1;
    div(psiPhiByRho,p) Gauss limitedLinear 1;

}

laplacianSchemes
{
    default         Gauss linear corrected;

}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    rho;
    p;
}


// ************************************************************************* //
